#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-east-1:439793709230:certificate/c4e92cdb-24c0-441c-94db-b3f4abbed378]
data.aws_cloudfront_cache_policy.cache_policy: Reading...
aws_cloudfront_origin_access_control.default: Refreshing state... [id=EV1HZVTQ1U0BW]
aws_s3_bucket.s3-bucket: Refreshing state... [id=caitlingbailey.com]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
data.aws_cloudfront_cache_policy.cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.zone: Reading...
data.aws_route53_zone.zone: Read complete after 0s [id=Z05129602064YT69ODB82]
aws_s3_bucket_public_access_block.website_bucket_access: Refreshing state... [id=caitlingbailey.com]
aws_s3_bucket_versioning.website-bucket-versioning: Refreshing state... [id=caitlingbailey.com]
aws_s3_bucket_website_configuration.website-bucket-config: Refreshing state... [id=caitlingbailey.com]
aws_cloudfront_distribution.cdn_static_website: Refreshing state... [id=E2ZTE2KW0H2XW9]
aws_s3_bucket_policy.website-bucket-policy: Refreshing state... [id=caitlingbailey.com]
aws_route53_record.www: Refreshing state... [id=Z05129602064YT69ODB82_www.caitlingbailey.com_A]
aws_route53_record.apex: Refreshing state... [id=Z05129602064YT69ODB82_caitlingbailey.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cdn_static_website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "cdn_static_website" {
        id                              = "E2ZTE2KW0H2XW9"
      ~ price_class                     = "PriceClass_All" -> "PriceClass_100"
        tags                            = {}
        # (21 unchanged attributes hidden)

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      ~ default_cache_behavior {
          ~ allowed_methods            = [
              - "OPTIONS",
                # (2 unchanged elements hidden)
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          ~ compress                   = false -> true
            # (13 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

            # (1 unchanged block hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "caitlingbailey.com.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "EV1HZVTQ1U0BW" -> null
          - origin_id                = "my-s3-origin" -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "caitlingbailey.com.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "caitlingbailey.com"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.default will be destroyed
  # (because aws_cloudfront_origin_access_control.default is not in configuration)
  - resource "aws_cloudfront_origin_access_control" "default" {
      - arn                               = "arn:aws:cloudfront::439793709230:origin-access-control/EV1HZVTQ1U0BW" -> null
      - description                       = "description OAC" -> null
      - etag                              = "ETVPDKIKX0DER" -> null
      - id                                = "EV1HZVTQ1U0BW" -> null
      - name                              = "cloudfront OAC" -> null
      - origin_access_control_origin_type = "s3" -> null
      - signing_behavior                  = "always" -> null
      - signing_protocol                  = "sigv4" -> null
    }

  # aws_cloudfront_origin_access_control.website_origin_access_control will be created
  + resource "aws_cloudfront_origin_access_control" "website_origin_access_control" {
      + arn                               = (known after apply)
      + description                       = "Cloudfront access control policy for the caitlingbailey.com distribution."
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "caitlingbailey.com Access Control Policy"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>